#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform plan:

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.inline["S3Artifacts"] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "inline" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "AllowS3ArtifactsAccess"
        }
    }

  # aws_cloudwatch_log_group.cw will be created
  + resource "aws_cloudwatch_log_group" "cw" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/codebuild/codebuild-cw-logs"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-1"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Name" = "codebuild-cw-logs"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "codebuild-cw-logs"
          + "Purpose"     = "Demo CodeBuild by Terraform CI/CD"
          + "Region"      = "ap-southeast-1"
        }
    }

  # aws_codebuild_project.demo-codebuild will be created
  + resource "aws_codebuild_project" "demo-codebuild" {
      + arn                  = (known after apply)
      + auto_retry_limit     = (known after apply)
      + badge_enabled        = false
      + badge_url            = (known after apply)
      + build_timeout        = 5
      + description          = "Demo CodeBuild by Terraform CI/CD"
      + encryption_key       = (known after apply)
      + id                   = (known after apply)
      + name                 = "demo-codebuild-tf"
      + project_visibility   = "PRIVATE"
      + public_project_alias = (known after apply)
      + queued_timeout       = 5
      + region               = "ap-southeast-1"
      + service_role         = (known after apply)
      + tags                 = {
          + "Name" = "demo-codebuild-tf"
        }
      + tags_all             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "demo-codebuild-tf"
          + "Purpose"     = "Demo CodeBuild by Terraform CI/CD"
          + "Region"      = "ap-southeast-1"
        }

      + artifacts {
          + encryption_disabled    = false
          + location               = (known after apply)
          + override_artifact_name = false
          + path                   = "Demo-Artifacts"
          + type                   = "S3"
        }

      + cache {
          + location = (known after apply)
          + type     = "S3"
        }

      + environment {
          + compute_type                = "BUILD_GENERAL1_SMALL"
          + image                       = "aws/codebuild/amazonlinux-x86_64-standard:5.0"
          + image_pull_credentials_type = "CODEBUILD"
          + privileged_mode             = false
          + type                        = "LINUX_CONTAINER"

          + environment_variable {
              + name  = "SOME_KEY1"
              + type  = "PLAINTEXT"
              + value = "SOME_VALUE1"
            }
          + environment_variable {
              + name  = "SOME_KEY2"
              + type  = "PARAMETER_STORE"
              + value = "SOME_VALUE2"
            }
        }

      + logs_config {
          + cloudwatch_logs {
              + group_name = "/aws/codebuild/codebuild-cw-logs"
              + status     = "ENABLED"
            }
        }

      + source {
          + location            = "https://github.com/troynguyeen/terraform-demo.git"
          + report_build_status = true
          + type                = "GITHUB"

          + auth {
              + resource = "arn:aws:codeconnections:ap-southeast-1:381492178574:connection/2b5d9d8f-f158-485a-84d3-d059c7bdccb3"
              + type     = "CODECONNECTIONS"
            }
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-073d19e4e6133069c",
            ]
          + subnets            = [
              + "subnet-0f181d15fd4697726",
              + "subnet-0f36b29b91f6d701b",
            ]
          + vpc_id             = "vpc-0cdaed73ee1f56a9d"
        }
    }

  # aws_iam_role.role will be created
  + resource "aws_iam_role" "role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codebuild.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo-codebuild-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "demo-codebuild-role"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "demo-codebuild-role"
          + "Purpose"     = "Demo CodeBuild by Terraform CI/CD"
          + "Region"      = "ap-southeast-1"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.inline["CICD"] will be created
  + resource "aws_iam_role_policy" "inline" {
      + id          = (known after apply)
      + name        = "CICD"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "codebuild:UpdateReport",
                          + "codebuild:CreateReportGroup",
                          + "codebuild:CreateReport",
                          + "codebuild:BatchPutTestCases",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:codebuild:ap-southeast-1:381492178574:report-group/*"
                      + Sid      = "AllowCICDAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.inline["CodeArtifact"] will be created
  + resource "aws_iam_role_policy" "inline" {
      + id          = (known after apply)
      + name        = "CodeArtifact"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "codeartifact:ReadFromRepository",
                          + "codeartifact:GetRepositoryEndpoint",
                          + "codeartifact:GetAuthorizationToken",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowCodeArtifactAccess"
                    },
                  + {
                      + Action    = "sts:GetServiceBearerToken"
                      + Condition = {
                          + StringEquals = {
                              + "sts:AWSServiceName" = "codeartifact.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.inline["CodeConnections"] will be created
  + resource "aws_iam_role_policy" "inline" {
      + id          = (known after apply)
      + name        = "CodeConnections"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "codeconnections:GetConnectionToken",
                          + "codeconnections:GetConnection",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:codeconnections:ap-southeast-1:381492178574:connection/*"
                      + Sid      = "AllowCodeConnectionsAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.inline["ECR"] will be created
  + resource "aws_iam_role_policy" "inline" {
      + id          = (known after apply)
      + name        = "ECR"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowECRAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.inline["KMS"] will be created
  + resource "aws_iam_role_policy" "inline" {
      + id          = (known after apply)
      + name        = "KMS"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "kms:GenerateDataKey",
                          + "kms:Encrypt",
                          + "kms:Decrypt",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowKMSAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.inline["Logs"] will be created
  + resource "aws_iam_role_policy" "inline" {
      + id          = (known after apply)
      + name        = "Logs"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:ap-southeast-1:381492178574:log-group:/aws/codebuild/*"
                      + Sid      = "AllowLogsAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.inline["Networking"] will be created
  + resource "aws_iam_role_policy" "inline" {
      + id          = (known after apply)
      + name        = "Networking"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:CreateNetworkInterfacePermission",
                          + "ec2:CreateNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowNetworkingAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.inline["S3Artifacts"] will be created
  + resource "aws_iam_role_policy" "inline" {
      + id          = (known after apply)
      + name        = "S3Artifacts"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.inline["S3StateFile"] will be created
  + resource "aws_iam_role_policy" "inline" {
      + id          = (known after apply)
      + name        = "S3StateFile"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::demo-terraform-backend-state/*.tflock"
                      + Sid      = "AllowS3StateFileAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.inline["Secrets"] will be created
  + resource "aws_iam_role_policy" "inline" {
      + id          = (known after apply)
      + name        = "Secrets"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowSecretsManagerAccess"
                    },
                  + {
                      + Action   = [
                          + "ssm:GetParametersByPath",
                          + "ssm:GetParameters",
                          + "ssm:GetParameter",
                          + "ssm:DescribeParameters",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowSSMParameterStoreAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_s3_bucket.artifacts will be created
  + resource "aws_s3_bucket" "artifacts" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "demo-codebuild-artifacts-s3"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "demo-codebuild-artifacts-s3"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "demo-codebuild-artifacts-s3"
          + "Purpose"     = "Demo CodeBuild by Terraform CI/CD"
          + "Region"      = "ap-southeast-1"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_acl.artifacts will be created
  + resource "aws_s3_bucket_acl" "artifacts" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-southeast-1"

      + access_control_policy (known after apply)
    }

  # aws_s3_bucket_ownership_controls.artifacts will be created
  + resource "aws_s3_bucket_ownership_controls" "artifacts" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-southeast-1"

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

Plan: 16 to add, 0 to change, 0 to destroy.
```

</details>
*Pushed by: @troynguyeen, Action: `pull_request`*